#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[33mRunning plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
The remote workspace is configured to work with configuration at
./terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/nextbnb/nextbnb/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/nextbnb/nextbnb

[0m[33mTo view this run in a browser, visit:
https://app.terraform.io/app/do-it-simple/nextbnb/runs/run-xc2AMxQZQwUAX6bq[0m
[0m
Waiting for the plan to start...

Terraform v1.0.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
[0m[1mmodule.networking.aws_vpc.nextbnb-vpc: Refreshing state... [id=vpc-0650a16f203e11f33][0m
[0m[1mmodule.networking.aws_vpc.nextbnb_vpc: Refreshing state... [id=vpc-0722be33d935ea03a][0m
[0m[1mmodule.services.aws_sqs_queue.terraform_dead_letter_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/776733965771/dead_letter_queue][0m
[0m[1mmodule.auth.aws_cognito_user_pool.pool: Refreshing state... [id=us-east-1_ySpdtGQDh][0m
[0m[1mmodule.auth.aws_sqs_queue.terraform_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/776733965771/auth-service][0m
[0m[1mmodule.networking.aws_route_table.nextbnb_private_route_table: Refreshing state... [id=rtb-09da971ba2a84aa32][0m
[0m[1mmodule.networking.aws_subnet.public_subnet: Refreshing state... [id=subnet-02a263b28d9d07c5f][0m
[0m[1mmodule.networking.aws_subnet.private_subnet: Refreshing state... [id=subnet-0aba57c2f03277c34][0m
[0m[1mmodule.networking.aws_default_route_table.nextbnb_public_route_table: Refreshing state... [id=rtb-043cba267f9b3d7f5][0m
[0m[1mmodule.networking.aws_internet_gateway.nextbnb_internet_gateway: Refreshing state... [id=igw-0ddf3d1c0ad1ba22b][0m
[0m[1mmodule.networking.aws_route_table_association.nextbnb_private_route_table: Refreshing state... [id=rtbassoc-0732eb51e17a723d1][0m
[0m[1mmodule.networking.aws_route_table_association.nextbnb_public_route_table: Refreshing state... [id=rtbassoc-012282c1619259bfe][0m
[0m
[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m

[0mTerraform detected the following changes made outside of Terraform since the
last "terraform apply":

[1m  # module.networking.aws_default_route_table.nextbnb_public_route_table[0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "aws_default_route_table" "nextbnb_public_route_table" {
      [31m-[0m [0m[1m[0marn[0m[0m                    = "arn:aws:ec2:us-east-1:776733965771:route-table/rtb-043cba267f9b3d7f5" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdefault_route_table_id[0m[0m = "rtb-043cba267f9b3d7f5" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                     = "rtb-043cba267f9b3d7f5" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mowner_id[0m[0m               = "776733965771" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mroute[0m[0m                  = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m                   = {
          [31m-[0m [0m"Name" = "nextbnb-public-route-table"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags_all[0m[0m               = {
          [31m-[0m [0m"Name" = "nextbnb-public-route-table"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mvpc_id[0m[0m                 = "vpc-0722be33d935ea03a" [90m->[0m [0m[90mnull[0m[0m
    }
[1m  # module.networking.aws_internet_gateway.nextbnb_internet_gateway[0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "aws_internet_gateway" "nextbnb_internet_gateway" {
      [31m-[0m [0m[1m[0marn[0m[0m      = "arn:aws:ec2:us-east-1:776733965771:internet-gateway/igw-0ddf3d1c0ad1ba22b" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m       = "igw-0ddf3d1c0ad1ba22b" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mowner_id[0m[0m = "776733965771" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m     = {
          [31m-[0m [0m"Name" = "nextbnb-internet-gateway"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags_all[0m[0m = {
          [31m-[0m [0m"Name" = "nextbnb-internet-gateway"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mvpc_id[0m[0m   = "vpc-0650a16f203e11f33" [90m->[0m [0m[90mnull[0m[0m
    }
[1m  # module.networking.aws_subnet.private_subnet[0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "aws_subnet" "private_subnet" {
      [31m-[0m [0m[1m[0marn[0m[0m                             = "arn:aws:ec2:us-east-1:776733965771:subnet/subnet-0aba57c2f03277c34" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mavailability_zone[0m[0m               = "us-east-1b" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mavailability_zone_id[0m[0m            = "use1-az2" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcidr_block[0m[0m                      = "10.0.2.0/24" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                              = "subnet-0aba57c2f03277c34" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmap_customer_owned_ip_on_launch[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m         = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mowner_id[0m[0m                        = "776733965771" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m                            = {
          [31m-[0m [0m"Name" = "nextbnb-private-subnet"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags_all[0m[0m                        = {
          [31m-[0m [0m"Name" = "nextbnb-private-subnet"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mvpc_id[0m[0m                          = "vpc-0722be33d935ea03a" [90m->[0m [0m[90mnull[0m[0m
    }
[1m  # module.networking.aws_route_table.nextbnb_private_route_table[0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "aws_route_table" "nextbnb_private_route_table" {
      [31m-[0m [0m[1m[0marn[0m[0m              = "arn:aws:ec2:us-east-1:776733965771:route-table/rtb-09da971ba2a84aa32" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m               = "rtb-09da971ba2a84aa32" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mowner_id[0m[0m         = "776733965771" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mpropagating_vgws[0m[0m = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mroute[0m[0m            = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m             = {
          [31m-[0m [0m"Name" = "nextbnb-private-route-table"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags_all[0m[0m         = {
          [31m-[0m [0m"Name" = "nextbnb-private-route-table"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mvpc_id[0m[0m           = "vpc-0722be33d935ea03a" [90m->[0m [0m[90mnull[0m[0m
    }
[1m  # module.networking.aws_route_table_association.nextbnb_private_route_table[0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "aws_route_table_association" "nextbnb_private_route_table" {
      [31m-[0m [0m[1m[0mid[0m[0m             = "rtbassoc-0732eb51e17a723d1" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mroute_table_id[0m[0m = "rtb-09da971ba2a84aa32" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0msubnet_id[0m[0m      = "subnet-0aba57c2f03277c34" [90m->[0m [0m[90mnull[0m[0m
    }
[1m  # module.networking.aws_route_table_association.nextbnb_public_route_table[0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "aws_route_table_association" "nextbnb_public_route_table" {
      [31m-[0m [0m[1m[0mid[0m[0m             = "rtbassoc-012282c1619259bfe" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mroute_table_id[0m[0m = "rtb-043cba267f9b3d7f5" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0msubnet_id[0m[0m      = "subnet-02a263b28d9d07c5f" [90m->[0m [0m[90mnull[0m[0m
    }
[1m  # module.networking.aws_vpc.nextbnb-vpc[0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "aws_vpc" "nextbnb-vpc" {
      [31m-[0m [0m[1m[0marn[0m[0m                              = "arn:aws:ec2:us-east-1:776733965771:vpc/vpc-0650a16f203e11f33" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0massign_generated_ipv6_cidr_block[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcidr_block[0m[0m                       = "10.0.0.0/16" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdefault_network_acl_id[0m[0m           = "acl-076c2912c1adc3e24" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdefault_route_table_id[0m[0m           = "rtb-0b1c729edbe58fb43" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdefault_security_group_id[0m[0m        = "sg-0b2f0b569cb50dd25" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdhcp_options_id[0m[0m                  = "dopt-b17af4cb" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_classiclink[0m[0m               = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_classiclink_dns_support[0m[0m   = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_dns_hostnames[0m[0m             = true [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_dns_support[0m[0m               = true [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                               = "vpc-0650a16f203e11f33" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0minstance_tenancy[0m[0m                 = "default" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmain_route_table_id[0m[0m              = "rtb-0b1c729edbe58fb43" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mowner_id[0m[0m                         = "776733965771" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m                             = {
          [31m-[0m [0m"Name" = "nextbnb-vpc"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags_all[0m[0m                         = {
          [31m-[0m [0m"Name" = "nextbnb-vpc"
        } [90m->[0m [0m[90mnull[0m[0m
    }
[1m  # module.networking.aws_vpc.nextbnb_vpc[0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "aws_vpc" "nextbnb_vpc" {
      [31m-[0m [0m[1m[0marn[0m[0m                              = "arn:aws:ec2:us-east-1:776733965771:vpc/vpc-0722be33d935ea03a" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0massign_generated_ipv6_cidr_block[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcidr_block[0m[0m                       = "10.0.0.0/16" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdefault_network_acl_id[0m[0m           = "acl-0e3aaf70de71ad59b" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdefault_route_table_id[0m[0m           = "rtb-043cba267f9b3d7f5" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdefault_security_group_id[0m[0m        = "sg-0faa77c5e1461d2fa" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdhcp_options_id[0m[0m                  = "dopt-b17af4cb" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_classiclink[0m[0m               = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_classiclink_dns_support[0m[0m   = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_dns_hostnames[0m[0m             = true [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_dns_support[0m[0m               = true [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                               = "vpc-0722be33d935ea03a" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0minstance_tenancy[0m[0m                 = "default" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmain_route_table_id[0m[0m              = "rtb-043cba267f9b3d7f5" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mowner_id[0m[0m                         = "776733965771" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m                             = {
          [31m-[0m [0m"Name" = "nextbnb-vpc"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags_all[0m[0m                         = {
          [31m-[0m [0m"Name" = "nextbnb-vpc"
        } [90m->[0m [0m[90mnull[0m[0m
    }
[1m  # module.networking.aws_subnet.public_subnet[0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "aws_subnet" "public_subnet" {
      [31m-[0m [0m[1m[0marn[0m[0m                             = "arn:aws:ec2:us-east-1:776733965771:subnet/subnet-02a263b28d9d07c5f" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mavailability_zone[0m[0m               = "us-east-1a" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mavailability_zone_id[0m[0m            = "use1-az1" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcidr_block[0m[0m                      = "10.0.1.0/24" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                              = "subnet-02a263b28d9d07c5f" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmap_customer_owned_ip_on_launch[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m         = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mowner_id[0m[0m                        = "776733965771" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m                            = {
          [31m-[0m [0m"Name" = "nextbnb-public-subnet"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags_all[0m[0m                        = {
          [31m-[0m [0m"Name" = "nextbnb-public-subnet"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mvpc_id[0m[0m                          = "vpc-0722be33d935ea03a" [90m->[0m [0m[90mnull[0m[0m
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.networking.aws_default_route_table.nextbnb_public_route_table[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_default_route_table" "nextbnb_public_route_table" {
      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mdefault_route_table_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mroute[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Name" = "nextbnb-public-route-table"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Name" = "nextbnb-public-route-table"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                 = (known after apply)
    }

[1m  # module.networking.aws_internet_gateway.nextbnb_internet_gateway[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_internet_gateway" "nextbnb_internet_gateway" {
      [32m+[0m [0m[1m[0marn[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m     = {
          [32m+[0m [0m"Name" = "nextbnb-internet-gateway"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m = {
          [32m+[0m [0m"Name" = "nextbnb-internet-gateway"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m   = (known after apply)
    }

[1m  # module.networking.aws_route_table.nextbnb_private_route_table[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table" "nextbnb_private_route_table" {
      [32m+[0m [0m[1m[0marn[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpropagating_vgws[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mroute[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m             = {
          [32m+[0m [0m"Name" = "nextbnb-private-route-table"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m         = {
          [32m+[0m [0m"Name" = "nextbnb-private-route-table"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m           = (known after apply)
    }

[1m  # module.networking.aws_route_table_association.nextbnb_private_route_table[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table_association" "nextbnb_private_route_table" {
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = (known after apply)
    }

[1m  # module.networking.aws_route_table_association.nextbnb_public_route_table[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table_association" "nextbnb_public_route_table" {
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = (known after apply)
    }

[1m  # module.networking.aws_subnet.private_subnet[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_subnet" "private_subnet" {
      [32m+[0m [0m[1m[0marn[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m = false
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m               = "us-east-1b"
      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mcidr_block[0m[0m                      = "10.0.2.0/24"
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m         = false
      [32m+[0m [0m[1m[0mowner_id[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                            = {
          [32m+[0m [0m"Name" = "nextbnb-private-subnet"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                        = {
          [32m+[0m [0m"Name" = "nextbnb-private-subnet"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                          = (known after apply)
    }

[1m  # module.networking.aws_subnet.public_subnet[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_subnet" "public_subnet" {
      [32m+[0m [0m[1m[0marn[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m = false
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m               = "us-east-1a"
      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mcidr_block[0m[0m                      = "10.0.1.0/24"
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m         = false
      [32m+[0m [0m[1m[0mowner_id[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                            = {
          [32m+[0m [0m"Name" = "nextbnb-public-subnet"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                        = {
          [32m+[0m [0m"Name" = "nextbnb-public-subnet"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                          = (known after apply)
    }

[1m  # module.networking.aws_vpc.nextbnb_vpc[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_vpc" "nextbnb_vpc" {
      [32m+[0m [0m[1m[0marn[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0massign_generated_ipv6_cidr_block[0m[0m = false
      [32m+[0m [0m[1m[0mcidr_block[0m[0m                       = "10.0.0.0/16"
      [32m+[0m [0m[1m[0mdefault_network_acl_id[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdefault_route_table_id[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdefault_security_group_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mdhcp_options_id[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0menable_classiclink[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0menable_classiclink_dns_support[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0menable_dns_hostnames[0m[0m             = true
      [32m+[0m [0m[1m[0menable_dns_support[0m[0m               = true
      [32m+[0m [0m[1m[0mid[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0minstance_tenancy[0m[0m                 = "default"
      [32m+[0m [0m[1m[0mipv6_association_id[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mmain_route_table_id[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                             = {
          [32m+[0m [0m"Name" = "nextbnb-vpc"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                         = {
          [32m+[0m [0m"Name" = "nextbnb-vpc"
        }
    }

[0m[1mPlan:[0m 8 to add, 0 to change, 0 to destroy.
[0m

```

</details>

*Pusher: @kokiebisu, Action: `pull_request`*